kipperjjang/Capstone_design_team3/STM32_codesave/capstone_aimming/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

//#include "DRV8323_setting.h"
#include "DRV8353_setting.h"
#include "AS5048A.h"
#include "arm_math.h"
#include "core_cm4.h"
#include "stdio.h"
#include "stm32g4xx_ll_cordic.h"
#include "stm32g4xx_ll_bus.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

#define invsqrt3 (0.57735027f)
#define SECTOR_RAD  (1.04719755f)      // π/3
#define V_LIMIT (V_BUS * invsqrt3)     // real maximum limit
#define CPU_HZ (168000000.0f)

#define ARR_TICKS   4199               // TIM1 max ARR
#define V_BUS (24.0f)                  // input bus voltage
#define Vd_limit (V_LIMIT * 0.9f)      // Vd limit voltage. 0.98 is safety factor

#define CMD_AIM         (1 << 0)
#define CMD_SHOOT       (1 << 1)
#define CMD_STOP        (1 << 2)

#define CAN_CMD_POS_SCALE       1000000.0f   // int32 = rad * 1e6
#define CAN_CMD_VEL_SCALE       1000.0f      // int16 = rad/s * 1e3

#define CAN_FB_POS_SCALE        10000.0f     // int16 = rad * 1e4
#define CAN_FB_VEL_SCALE        1000.0f      // int16 = rad/s * 1e3
#define CAN_FB_TORQUE_SCALE     1000.0f      // int16 = torque * 1e3

#define MOTOR_ERR_NONE          0x00
#define MOTOR_ERR_CMD_TIMEOUT   (1 << 0)
#define MOTOR_ERR_LIMIT         (1 << 1)
#define MOTOR_ERR_DRV           (1 << 2)
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;
ADC_HandleTypeDef hadc3;
DMA_HandleTypeDef hdma_adc1;
DMA_HandleTypeDef hdma_adc2;
DMA_HandleTypeDef hdma_adc3;

CORDIC_HandleTypeDef hcordic;

FDCAN_HandleTypeDef hfdcan2;

SPI_HandleTypeDef hspi1;
SPI_HandleTypeDef hspi3;

TIM_HandleTypeDef htim1;

/* USER CODE BEGIN PV */

// CAN communication setting
FDCAN_FilterTypeDef sFilter;
FDCAN_RxHeaderTypeDef   Rx_Header;
FDCAN_TxHeaderTypeDef   Tx_Header;
uint8_t               Rx_Data[8];
uint8_t               Tx_Data[8];

uint8_t CAN_setting_status = 0;
uint8_t CAN_receive_status = 0;
uint8_t CAN_transmit_status = 0;

#define NODE_ID              0U      // board0 0 / board1 1
#define CAN_ID_CMD_BASE      0x100U
#define CAN_ID_STATUS_BASE   0x180U

#define CAN_ID_CMD           (CAN_ID_CMD_BASE + NODE_ID)    // command receive id
#define CAN_ID_STATUS        (CAN_ID_STATUS_BASE + NODE_ID) // status send id


// PWM start status. CH1_start / CH2_start / CH3_start / TIM1_ISR_start / ADC1_start / ADC2_start / ADC3_start / ALL_OK
uint8_t PWM_ADC_status = 0;
// DRV8353 setting status. 0x00 / 0x01 / 0x02 / 0x03 / 0x04 / 0x05 / 0x06 / ALL_OK
uint8_t DRV8353_status = 0;

uint8_t ADC_cali_status;

uint16_t current_A[1];
uint16_t current_B[1];
uint16_t current_C[1];

// ADC calibrated value (different for each board and chip)
#define current_A_calibrated 2045  // board0 2045 / board1 2047
#define current_B_calibrated 2058  // board0 2058 / board1 2056
#define current_C_calibrated 2031

// motor
uint16_t AS5048_zeropos = 10483;   // board0 10483 / board1 11178
#define polepair 7
float ELEC_CNT = 16384.0f / (float)polepair;
float P  = 6.0f;
float I  = 0.4f;
float Ka = 0.5f;

float iq_ref = 0.0f, id_ref = 0.0f;               // reference current

int16_t ia, ib, ic;
float electrical_angle, _sin, _cos;                              // electrical angle, sin & cos
float i_alpha, i_alpha_prev, i_alpha_LPF, i_beta, i_beta_prev, i_beta_LPF;                // inv park & clarke
float iq, id, iq_err, id_err, iq_err_integral, id_err_integral;  // PI control
float Vq, Vd, V_alpha, V_beta;                                   // park

uint8_t encoder_cali = 0;
float V_mag = 1.0f, V_arg = 0.0f, V_cali_speed;

volatile float pos_ref_mech_rad    = 0.0f;

float pos_P = 5.0f;
float pos_D = 0.2f;

float P_part, D_part;

float all_us;
float cali_sin, cali_cos;

float current_log_1[10000];
float current_log_2[10000];

uint8_t current_log = 0;
uint8_t current_dump = 0;
uint32_t i, j, flip;

#define AS5048_CPR        (16384.0f)
#define AS5048_TO_RAD     (2.0f * PI / AS5048_CPR)

#define POS_CTRL_HZ       (20000.0f)
#define POS_CTRL_DT       (1.0f / POS_CTRL_HZ)

#define W_M_LPF_ALPHA     (0.005f)

float th_m       = 0.0f;   // mechanical angle, wrapped [-pi, pi)
float th_m_cont  = 0.0f;   // continuous mechanical angle [rad]
float w_m        = 0.0f;   // filtered mechanical speed [rad/s]
float w_m_raw    = 0.0f;   // raw mechanical speed [rad/s]

float th_m_prev    = 0.0f;
uint8_t th_m_init  = 0U;

uint16_t AS5048_mech_zeropos = 8000; // board0 8000 / board1 11940
float mech_limit = PI/2;

volatile uint8_t can_cmd = 0;
volatile uint8_t can_cmd_seq = 0;
volatile uint8_t can_last_cmd_seq = 0;
volatile uint8_t can_cmd_seq_valid = 0;
volatile uint32_t can_rx_count = 0;
volatile uint32_t can_tx_count = 0;
volatile uint32_t can_tx_fail_count = 0;
volatile uint32_t last_can_cmd_tick = 0;
volatile float can_target_pos = 0.0f;
volatile float can_target_vel = 0.0f;
volatile uint8_t motor_error_code = MOTOR_ERR_NONE;

uint8_t not_aim = 1;
/* USER CODE END PV */

