kipperjjang/Capstone_design_team3/STM32_codesave/capstone_aimming/Core/Src/main.c
/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_FDCAN2_Init(void);
static void MX_TIM1_Init(void);
static void MX_SPI1_Init(void);
static void MX_ADC2_Init(void);
static void MX_ADC3_Init(void);
static void MX_SPI3_Init(void);
static void MX_ADC1_Init(void);
static void MX_CORDIC_Init(void);
/* USER CODE BEGIN PFP */

// Forward declarations
static inline uint32_t dwt_now(void);
static inline float cycles_to_us(uint32_t cyc);
static inline float wrap_pm_pi(float x);
static inline float clampf(float x, float lo, float hi);
static inline uint16_t clamp_u16_i32(int32_t x, uint16_t lo, uint16_t hi);
static inline int8_t sign_hyst(float x, float eps);
static inline int8_t sign_hold(float x, float eps, int8_t *last);
int __io_putchar(int ch);
static inline void DWT_Init(void);
void set_ccr(uint16_t a, uint16_t b, uint16_t c);
static inline void CORDIC_Init_Phase(void);
static inline int32_t float_to_q31(float x);
static inline float cordic_atan2_rad(float y, float x);
static inline float sat(float x);

void SVPWM(float, float);

static inline float AS5048_CountToMechRad(uint16_t cnt);
static inline void MechAngleSpeed_Update(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

static inline float AS5048_CountToMechRad(uint16_t cnt){
    int32_t dcnt = (int32_t)cnt - (int32_t)AS5048_mech_zeropos;

    if (dcnt < 0) {
        dcnt += 16384;
    }

    // 0 ~ 2pi
    float th = (float)dcnt * AS5048_TO_RAD;

    // -pi ~ pi
    if (th >= PI) {
        th -= 2.0f * PI;
    }

    return th;
}

static inline void MechAngleSpeed_Update(void){
    float th_now = AS5048_CountToMechRad((uint16_t)mech_angle);

    if (!th_m_init) {
        th_m       = th_now;
        th_m_prev  = th_now;
        th_m_cont  = th_now;
        w_m_raw    = 0.0f;
        w_m        = 0.0f;
        th_m_init  = 1U;
        return;
    }

    // encoder wrap 보정된 delta angle
    float dth = wrap_pm_pi(th_now - th_m_prev);

    th_m_prev = th_now;
    th_m      = th_now;

    // multi-turn continuous angle
    th_m_cont += dth;

    // mechanical angular velocity [rad/s]
    w_m_raw = dth * POS_CTRL_HZ;

    // 간단한 1차 LPF
    w_m += W_M_LPF_ALPHA * (w_m_raw - w_m);
}

#define IQ_REF_LIMIT    (0.8f)
static inline void PositionPD_Update(void){
	pos_ref_mech_rad = (pos_ref_mech_rad > mech_limit) ? mech_limit : (pos_ref_mech_rad < -mech_limit) ? -mech_limit : pos_ref_mech_rad;

    float e = pos_ref_mech_rad - th_m_cont;

    P_part = pos_P * e;
    D_part = - pos_D * w_m;

    float iq_cmd = (P_part + D_part);

    iq_cmd = (iq_cmd > IQ_REF_LIMIT) ? IQ_REF_LIMIT :
             (iq_cmd < -IQ_REF_LIMIT) ? -IQ_REF_LIMIT : iq_cmd;

    iq_ref = iq_cmd;

    if(not_aim){
    	iq_ref = 0.0f;
    	id_ref = 0.0f;
    }
}

uint32_t debug_time_start, SVPWM_end;

#define measure_limit (V_BUS * 2)  //atan2 limit. change for max voltage or max current
#define current_const (0.00805664f*2)  // 10V/V Op-amp gain
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim){  //TIM interrupt rank has to be added in main()
	if(htim->Instance == TIM1){
		debug_time_start = dwt_now();

		AS5048A_ReadAngle();

		float delta = (float) (mech_angle - AS5048_zeropos);
		if(delta < 0.0) delta = delta + 16384.0;
		while(delta > ELEC_CNT){
			delta = delta - ELEC_CNT;
		}
		electrical_angle = delta * 360.0f / ELEC_CNT;

		if (electrical_angle > 180.0f) electrical_angle -= 360.0f;

		arm_sin_cos_f32(electrical_angle,&_sin,&_cos);

		MechAngleSpeed_Update();
		PositionPD_Update();

		// alpha beta current calculation
		ic = current_A[0] - current_A_calibrated;  // A<->C mapping hardware issue
		ib = current_B[0] - current_B_calibrated;
		//ia = current_C[0] - current_C_calibrated;  // A<->C mapping hardware issue
		ia = -(ib+ic); // ia is very unstable. currnet_C has big jitter (+-10 LSB) (maybe hardware PCB problem. maybe charge pump?)

		// inv clarke
		i_alpha = ia * current_const;                   // i_alpha = 2/3 * (ia - (ib + ic)/2) = ia
		i_beta  = (ib - ic) * invsqrt3 * current_const; // i_beta  = 2/3 * (ib - ic) * sqrt(3)/2 = (ib - ic) * 1/sqrt(3)


		if(encoder_cali){
			V_arg = V_arg + V_cali_speed;

			if(V_arg > 180.0f)
				V_arg -= 360.0f;
			else if(V_arg < -180.0f)
				V_arg += 360.0f;

			arm_sin_cos_f32(V_arg,&cali_sin,&cali_cos);

			SVPWM(V_mag * cali_cos, V_mag * cali_sin);
			return;
		}

		// inv park, using high frequency rejected
		id =  i_alpha * _cos + i_beta * _sin;
		iq = -i_alpha * _sin + i_beta * _cos;

		//PI
		iq_err = iq_ref - iq;
		id_err = id_ref - id;
		iq_err_integral = iq_err_integral + iq_err;
		id_err_integral = id_err_integral + id_err;

		// Vq, Vd calculation
		float Vq_unsat = (P * iq_err) + (I * iq_err_integral);
		float Vd_unsat = (P * id_err) + (I * id_err_integral);

		Vd = (Vd_unsat > Vd_limit) ? Vd_limit : (Vd_unsat < -Vd_limit) ? -Vd_limit : Vd_unsat;

		float Vq_limit;
		arm_sqrt_f32((V_LIMIT*V_LIMIT) - (Vd*Vd), &Vq_limit);
		Vq = (Vq_unsat > Vq_limit) ? Vq_limit : (Vq_unsat < -Vq_limit) ? -Vq_limit : Vq_unsat;

		iq_err_integral = iq_err_integral - Ka*(Vq_unsat - Vq);
		id_err_integral = id_err_integral - Ka*(Vd_unsat - Vd);

		// park
		V_alpha = Vd * _cos - Vq * _sin;
		V_beta  = Vd * _sin + Vq * _cos;

		SVPWM(V_alpha, V_beta);

		SVPWM_end = dwt_now();

		/*if(current_log){
			if(i++ < 10000){
				current_log_1[i] = iq_ref;
				current_log_2[i] = iq;
			}
		}

		if(flip++ == 49999){
			iq_ref = -iq_ref;
			flip = 0;
		}*/

		all_us               = cycles_to_us(SVPWM_end - debug_time_start);

	}
	return;
}

#define dt_ticks    	  (16.8f)
#define I_EPS             (0.05f)
#define SQRT3_BY_2        (0.8660254037844386f)
static int8_t sa_last=0, sb_last=0, sc_last=0;

void SVPWM(float Valpha, float Vbeta){
    float Vmag;
    arm_sqrt_f32(Valpha*Valpha + Vbeta*Vbeta, &Vmag);

    if (Vmag < 1e-6f) {
        set_ccr(ARR_TICKS - (uint16_t)(ARR_TICKS/2), ARR_TICKS - (uint16_t)(ARR_TICKS/2), ARR_TICKS - (uint16_t)(ARR_TICKS/2));
        return;
    }

    float M = 1.73205080f * (Vmag / V_BUS);
    if (M > 0.99f) M = 0.99f;

    float ang = cordic_atan2_rad(Vbeta, Valpha);
    if (ang < 0) ang += 6.2831853f;

    uint8_t k = (uint8_t)(ang / SECTOR_RAD);
    if (k >= 6) k = 0;

    float phi = ang - k*SECTOR_RAD;

    float T1 = M * arm_sin_f32(SECTOR_RAD - phi);
    float T2 = M * arm_sin_f32(phi);

    int32_t t1 = (int32_t)(ARR_TICKS * T1);
    int32_t t2 = (int32_t)(ARR_TICKS * T2);

    int32_t t0 = (ARR_TICKS - t1 - t2) >> 1;
    if (t0 < 0) t0 = 0;

    uint16_t Ua, Ub, Uc;
    switch (k){
        case 0: Ua=t1+t2+t0; Ub=t2+t0;     Uc=t0;            break;
        case 1: Ua=t1+t0;    Ub=t1+t2+t0;  Uc=t0;            break;
        case 2: Ua=t0;       Ub=t1+t2+t0;  Uc=t2+t0;         break;
        case 3: Ua=t0;       Ub=t1+t0;     Uc=t1+t2+t0;      break;
        case 4: Ua=t2+t0;    Ub=t0;        Uc=t1+t2+t0;      break;
        default:Ua=t1+t2+t0; Ub=t0;        Uc=t1+t0;         break;
    }

