kipperjjang/Capstone_design_team3/STM32_codesave/capstone_aimming/Core/Src/main.c
    // deadtime compensation
    float ia_deadtime = i_alpha;
    float ib_deadtime = -0.5f * i_alpha + SQRT3_BY_2 * i_beta;
    float ic_deadtime = -0.5f * i_alpha - SQRT3_BY_2 * i_beta;

    int8_t sa = sign_hold(ia_deadtime, I_EPS, &sa_last);
    int8_t sb = sign_hold(ib_deadtime, I_EPS, &sb_last);
    int8_t sc = sign_hold(ic_deadtime, I_EPS, &sc_last);
    int32_t duA = (int32_t) ((float)sa * dt_ticks);
    int32_t duB = (int32_t) ((float)sb * dt_ticks);
    int32_t duC = (int32_t) ((float)sc * dt_ticks);

    int32_t duM = (duA + duB + duC) / 3;
    duA -= duM; duB -= duM; duC -= duM;

    int32_t Ua_c = (int32_t)Ua + duA;
    int32_t Ub_c = (int32_t)Ub + duB;
    int32_t Uc_c = (int32_t)Uc + duC;

    int32_t minU = Ua_c;
    if (Ub_c < minU) minU = Ub_c;
    if (Uc_c < minU) minU = Uc_c;
    int32_t maxU = Ua_c;
    if (Ub_c > maxU) maxU = Ub_c;
    if (Uc_c > maxU) maxU = Uc_c;
    if (minU < 0) {
        Ua_c -= minU; Ub_c -= minU; Uc_c -= minU;
        maxU -= minU;
    }
    if (maxU > ARR_TICKS) {
        int32_t sh = maxU - ARR_TICKS;
        Ua_c -= sh; Ub_c -= sh; Uc_c -= sh;
    }
    Ua = clamp_u16_i32(Ua_c, 0, ARR_TICKS);
    Ub = clamp_u16_i32(Ub_c, 0, ARR_TICKS);
    Uc = clamp_u16_i32(Uc_c, 0, ARR_TICKS);
    set_ccr(ARR_TICKS - Ua, ARR_TICKS - Ub, ARR_TICKS - Uc);
}

static inline int16_t clamp_i16_from_float(float x)
{
    if (x > 32767.0f) return 32767;
    if (x < -32768.0f) return -32768;
    return (int16_t)x;
}

static inline int32_t get_i32_le(uint8_t *d)
{
    return (int32_t)((uint32_t)d[0]
                  | ((uint32_t)d[1] << 8)
                  | ((uint32_t)d[2] << 16)
                  | ((uint32_t)d[3] << 24));
}

static inline int16_t get_i16_le(uint8_t *d)
{
    return (int16_t)((uint16_t)d[0] | ((uint16_t)d[1] << 8));
}

static inline void put_i16_le(uint8_t *d, int16_t v)
{
    d[0] = (uint8_t)(v & 0xFF);
    d[1] = (uint8_t)((v >> 8) & 0xFF);
}

static void Motor_SendStatus(uint8_t seq)
{
    int16_t pos_q;
    int16_t vel_q;
    int16_t torque_q;

    pos_q = clamp_i16_from_float(th_m_cont * CAN_FB_POS_SCALE);
    vel_q = clamp_i16_from_float(w_m * CAN_FB_VEL_SCALE);

    // 여기서는 iq_ref를 torque 대신 임시로 보냄.
    // 실제 토크[Nm]를 보내려면 torque = Kt * iq 형태로 바꾸면 됨.
    torque_q = clamp_i16_from_float(iq * CAN_FB_TORQUE_SCALE);

    put_i16_le(&Tx_Data[0], pos_q);
    put_i16_le(&Tx_Data[2], vel_q);
    put_i16_le(&Tx_Data[4], torque_q);

    Tx_Data[6] = motor_error_code;
    Tx_Data[7] = seq;

    CAN_transmit_status =
        (HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan2, &Tx_Header, Tx_Data) == HAL_OK);

    if (CAN_transmit_status)
        can_tx_count++;
    else
        can_tx_fail_count++;
}

/* CAN Rx ISR start */
void HAL_FDCAN_RxFifo0Callback(FDCAN_HandleTypeDef *hfdcan, uint32_t RxFifo0ITs)
{
    if (hfdcan->Instance != FDCAN2)
        return;

    if ((RxFifo0ITs & FDCAN_IT_RX_FIFO0_NEW_MESSAGE) == 0)
        return;

    CAN_receive_status =
        (HAL_FDCAN_GetRxMessage(hfdcan, FDCAN_RX_FIFO0, &Rx_Header, Rx_Data) == HAL_OK);

    if (!CAN_receive_status)
        return;

    CAN_receive_status = 0;
    can_rx_count++;

    HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_3);  // green LED

    // 내 command ID가 아니면 무시
    if (Rx_Header.Identifier != CAN_ID_CMD)
        return;

    // Classic CAN 8 byte만 허용
    if (Rx_Header.DataLength != FDCAN_DLC_BYTES_8)
        return;

    int32_t pos_q = get_i32_le(&Rx_Data[0]);

    uint8_t P_q = Rx_Data[4];
    uint8_t D_q = Rx_Data[5];

    pos_P = ((float)P_q / 255.0f) * 20.0f;
    pos_D = ((float)D_q / 255.0f) * 1.0f;

    if(pos_P > 20.0f) pos_P = 20.0f;
    if(pos_P < 0.0f)  pos_P = 0.0f;

    if(pos_D > 1.0f) pos_D = 1.0f;
    if(pos_D < 0.0f) pos_D = 0.0f;

    uint8_t cmd = Rx_Data[6];
    uint8_t seq = Rx_Data[7];

    can_target_pos = ((float)pos_q) / CAN_CMD_POS_SCALE;

    can_cmd = cmd;
    can_cmd_seq = seq;
    last_can_cmd_tick = HAL_GetTick();

    if (can_cmd_seq_valid)
    {
        uint8_t expected = can_last_cmd_seq + 1;

        // 일단 에러로 막지는 않고 디버깅용으로만 사용
        if (seq != expected)
        {
            // 필요하면 별도 seq error bit 추가 가능
        }
    }
    else
    {
        can_cmd_seq_valid = 1;
    }

    can_last_cmd_seq = seq;

    if (cmd & CMD_AIM)
    {
        float ref = can_target_pos;

        if (ref > mech_limit)
        {
            ref = mech_limit;
            motor_error_code |= MOTOR_ERR_LIMIT;
        }
        else if (ref < -mech_limit)
        {
            ref = -mech_limit;
            motor_error_code |= MOTOR_ERR_LIMIT;
        }
        else
        {
            motor_error_code &= ~MOTOR_ERR_LIMIT;
        }

        pos_ref_mech_rad = ref;
        not_aim = 0;
    }
    else
    	not_aim = 1;

    if (DRV8353_status != 0xFF)
        motor_error_code |= MOTOR_ERR_DRV;
    else
        motor_error_code &= ~MOTOR_ERR_DRV;

    Motor_SendStatus(seq);
}
/* CAN Rx ISR end */


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_FDCAN2_Init();
  MX_TIM1_Init();
  MX_SPI1_Init();
  MX_ADC2_Init();
  MX_ADC3_Init();
  MX_SPI3_Init();
  MX_ADC1_Init();
  MX_CORDIC_Init();
  /* USER CODE BEGIN 2 */

  DWT_Init();
  CORDIC_Init_Phase();

  // ADC calibration
  ADC_cali_status |= (HAL_ADCEx_Calibration_Start(&hadc1, ADC_SINGLE_ENDED) == HAL_OK) << 2;
  ADC_cali_status |= (HAL_ADCEx_Calibration_Start(&hadc2, ADC_SINGLE_ENDED) == HAL_OK) << 1;
  ADC_cali_status |= (HAL_ADCEx_Calibration_Start(&hadc3, ADC_SINGLE_ENDED) == HAL_OK);

  // TIM 1 start
  PWM_ADC_status |= (HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1) == HAL_OK) << 7;
  PWM_ADC_status |= (HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_2) == HAL_OK) << 6;
  PWM_ADC_status |= (HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_3) == HAL_OK) << 5;
  TIM1->CCR1 = ARR_TICKS;
  TIM1->CCR2 = ARR_TICKS;
  TIM1->CCR3 = ARR_TICKS;


  // CAN filter
  sFilter.IdType       = FDCAN_STANDARD_ID;
  sFilter.FilterIndex  = 0;
  sFilter.FilterType   = FDCAN_FILTER_MASK;
  sFilter.FilterConfig = FDCAN_FILTER_TO_RXFIFO0;
  sFilter.FilterID1    = CAN_ID_CMD;   // 0x100 + NODE_ID
  sFilter.FilterID2    = 0x7FF;        // 11-bit exact match mask

  CAN_setting_status |= (HAL_FDCAN_ConfigFilter(&hfdcan2, &sFilter) == HAL_OK)                                                               << 7;
  CAN_setting_status |= (HAL_FDCAN_ConfigGlobalFilter(&hfdcan2,FDCAN_REJECT,FDCAN_REJECT,FDCAN_REJECT_REMOTE,FDCAN_REJECT_REMOTE) == HAL_OK) << 6;
  CAN_setting_status |= (HAL_FDCAN_ActivateNotification(&hfdcan2,FDCAN_IT_RX_FIFO0_NEW_MESSAGE,0) == HAL_OK)                                 << 5;
  CAN_setting_status |= (HAL_FDCAN_Start(&hfdcan2) == HAL_OK)                                                                                << 4;

  Tx_Header.Identifier          = CAN_ID_STATUS;       // 0x180 + NODE_ID
  Tx_Header.IdType              = FDCAN_STANDARD_ID;
  Tx_Header.TxFrameType         = FDCAN_DATA_FRAME;
  Tx_Header.DataLength          = FDCAN_DLC_BYTES_8;
  Tx_Header.ErrorStateIndicator = FDCAN_ESI_ACTIVE;
  Tx_Header.BitRateSwitch       = FDCAN_BRS_OFF;
  Tx_Header.FDFormat            = FDCAN_CLASSIC_CAN;
  Tx_Header.TxEventFifoControl  = FDCAN_NO_TX_EVENTS;
  Tx_Header.MessageMarker       = 0;


  HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_6);  // blue LED
  HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_3);  // green LED
  HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_15); // red LED

