kipperjjang/Capstone_design_team3/STM32_codesave/capstone_aimming/Core/Src/main.c
    // 사이클 카운터 enable
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
}

void set_ccr(uint16_t a, uint16_t b, uint16_t c){
    TIM1->CCR1 = a; TIM1->CCR2 = b; TIM1->CCR3 = c;
}

static inline void CORDIC_Init_Phase(void)
{
    LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_CORDIC);

    // PHASE(atan2) / 2 inputs / 1 output / 32-bit in/out / 적당한 precision
    LL_CORDIC_Config(CORDIC,
                     LL_CORDIC_FUNCTION_PHASE,
                     LL_CORDIC_PRECISION_6CYCLES,   // 필요시 4/6/8 cycles로 타협
                     LL_CORDIC_SCALE_0,
                     LL_CORDIC_NBWRITE_2,
                     LL_CORDIC_NBREAD_1,
                     LL_CORDIC_INSIZE_32BITS,
                     LL_CORDIC_OUTSIZE_32BITS);
}

static inline int32_t float_to_q31(float x)
{
    if (x >  0.999999f) x =  0.999999f;
    if (x < -1.0f)      x = -1.0f;
    return (int32_t)(x * 2147483648.0f); // 2^31
}

static inline float cordic_atan2_rad(float y, float x){
    // 0,0 예외
//    float ax = fabsf(x), ay = fabsf(y);
//    float m = (ax > ay) ? ax : ay;
//    if (m < 1e-12f) return 0.0f;

    float xn = x / measure_limit;
    float yn = y / measure_limit;

    int32_t Xq = float_to_q31(xn);
    int32_t Yq = float_to_q31(yn);

    // 입력 write (X, Y)
    LL_CORDIC_WriteData(CORDIC, (uint32_t)Xq);
    LL_CORDIC_WriteData(CORDIC, (uint32_t)Yq);

    // 결과 read (각도)
    int32_t ang_q = (int32_t)LL_CORDIC_ReadData(CORDIC);

    const float Q31_TO_RAD = PI;
    float ang = ((float)ang_q / 2147483648.0f) * Q31_TO_RAD;
    return ang;
}

static inline float sat(float x){
    return clampf(x, -1.0f, 1.0f);
}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1){

  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
